---
kind: enumMember
id: F:Autodesk.Revit.UI.PostableCommand.FamilyTypes
enum: Autodesk.Revit.UI.PostableCommand
source: html/f6ccdc1b-6ac3-9c49-d0bb-8a7d1877eab0.htm
---
# Autodesk.Revit.UI.PostableCommand.FamilyTypes

Allows you to enter parameter values for existing family types, add parameters to the family, or create new types within the family.